taskt/Core/Automation/Commands/WindowGroup/IWindowStateProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IWindowStateProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsListCommand" [ label="GetWindowStatesFromWindowNamesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IWindowStateProperties" [ label="IWindowStateProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.SetWindowsStateCommand" [ label="SetWindowsStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" [ label="SetOneWindowStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetWindowStateFromWindowHandleCommand" [ label="GetWindowStateFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" [ label="SetWindowStateByWindowHandleCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.GetWindowStatesFromWindowNamesAsListCommand" -> "taskt.Core.Automation.Commands.IWindowStateProperties";
"taskt.Core.Automation.Commands.SetWindowsStateCommand" -> "taskt.Core.Automation.Commands.IWindowStateProperties";
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" -> "taskt.Core.Automation.Commands.IWindowStateProperties";
"taskt.Core.Automation.Commands.GetWindowStateFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowStateProperties";
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" -> "taskt.Core.Automation.Commands.IWindowStateProperties";
}
